{
    "Allied Bank Ltd PSX": "An analyst, speaking on condition of anonymity, said the sponsor, SMC, is still likely to delist even if it means a higher buyback cost.\nThe loss did not surprise analysts as Pakistan’s auto sector has been facing challenges on several fronts, including high energy costs, political instability, and an inability to secure letters of credit for imports amid a severe dollar shortage.\n“Although there is no positive development on the economic front, strong corporate results are acting as a support factor,” Sana Tawfik, an analyst at AHL, told Business Recorder.",
    "Askari Bank PSX": "Additionally, companies offering robust dividend yields, especially in the banking, energy, and fertiliser sectors, present opportunities for accumulation, noted AKD Securities.\nAfter receiving the NOC, they had three months to meet regulatory and legal requirements for formal licensing, failing which, their licences would be cancelled.\nABL announced in September last year to establish a wholly-owned exchange company, with an initial capital of Rs 1 billion.",
    "Bank Alfalah PSX": "These companies deserve even more credit this year, as does the corporate sector overall, since they have performed exceptionally well in a difficult and challenging economic environment, he added.\nBank Alfalah hits record profit of Rs36bn in 2023, declares highest-ever DPS - Mettis Link News Bank Alfalah hits record profit of Rs36bn in 2023, declares highest-ever DPS  Mettis Link News Bank Alfalah hits record profit of Rs36bn in 2023, declares highest-ever DPS  Mettis Link News Strong corporate performance drives final-hour buying rally at PSX Strong corporate performance drives final-hour buying rally at PSX  Business Recorder After a volatile session at the Pakistan Stock Exchange (PSX), strong corporate results helped stocks stage a final-hour rally, pushing the benchmark KSE-100 beyond 62,000 with an over 400-point gain on Thursday.\nPakistan opens up Islamic bond market to retail investors with first listed sukuk Pakistan opens up Islamic bond market to retail investors with first listed sukuk  The News International KARACHI: The Pakistan Stock Exchange (PSX) will host its first-ever auction of a one-year listed local currency sukuk on December 8 (Friday) to diversify government funding sources, boost Islamic finance, and develop a Shariah-compliant capital market.",
    "Bank Al Habib PSX": "Soneri Bank Limited (SNBL) on Wednesday reported a more than threefold increase in its annual profit for 2023, boosted by higher interest income and lower provisions.\nThis positivity in market can be attributed to maiden session of 16th National Assembly where the new elected representatives took their oath.\nThis increased investor confidence as country heads towards fulfillment of democratic process where the new government will take charge going forward.",
    "Bank Islami PSX": "MCB Bank acquired an additional 30 percent stake in its subsidiary, MCBAH Savings and Investments, at the cost of Rs.\nJS Bank maintained a different strategic position, which will increase its profitability and influence in the banking industry after this deal.\nPM Kakar said this gong sound echoed across financial corridor of the nation and signaled commitment for fostering robust ecosystem.",
    "Bank Makramah PSX": "This change has been officially communicated through a notice issued by the local bourse.\nBack in April, Lootah subscribed to 3.98 billion new shares of the bank at Rs2.51 per share, which translates into a subscription amount of Rs10 billion, giving him a majority equity stake.\nThis change has been officially communicated through a notice issued by the local bourse.",
    "Bank of Khyber PSX": "Separately, KP’s anti-corruption body has also called Ali Gul Faraz, former finance minister Taimur Jhagra, and other members of the board in for questioning.\nDistribution expense also escalated by 21 percent year-on-year in 2020 due to higher custom, clearance & freight on export and training of sales staff during the year.\nOther expense escalated by 484 percent in 2023 on account of profit related provisioning, FED and sales tax written offduring the year.",
    "Bank of Punjab PSX": "Amreen Soorani, head of research at JS Global, noted that the index had rallied by more than 60pc this year.\nThey also attribute Pak Suzuki Motor Company’s (PSMC) recent decision to consider delisting as a positive indication for small shareholders.\nDespite this, Barclays remained optimistic, stating that Pakistan is unlikely to default on Eurobonds and praised the Sharif-led government for playing a less disruptive role.",
    "Faysal Bank PSX": "It’s noteworthy that Faysal Bank Limited joins the ranks of major banks keen on participating in this transformative shift.\nAccording to the financial results, Pakistan’s second-biggest Islamic bank recorded a profit of over Rs.\nAfter receiving the NOC, they had three months to meet regulatory and legal requirements for formal licensing, failing which, their licences would be cancelled.",
    "Habib Bank PSX": "This move is part of a broader effort to combat illicit activities in the black market.\nThe remaining slots were taken by Indian, Australian, Vietnamese, New Zealand, Japanese and Indonesian banks.\nAdditionally, companies offering robust dividend yields, especially in the banking, energy, and fertiliser sectors, present opportunities for accumulation, noted AKD Securities.",
    "Habib Metropolitan Bank PSX": "These companies deserve even more credit this year, as does the corporate sector overall, since they have performed exceptionally well in a difficult and challenging economic environment, he added.\nCorporate Social Responsibility (CSR), reporting on Sustainable Development Goals (SDGs), ESG-related efforts, diversity, and inclusivity are the other key requirements.\nBulls keep control as stocks extend rally - The Express Tribune Bulls keep control as stocks extend rally  The Express Tribune Bulls keep control as stocks extend rally  The Express Tribune Habib Metro Bank to Set Up Exchange Company Habib Metro Bank to Set Up Exchange Company  ProPakistani Habib Metropolitan Bank Limited (PSX: HMB) is set to establish an Exchange Company with an authorized capital of Rs.",
    "JS Bank PSX": "Earlier in 2020, the Bank issued Pakistan’s first listed ADT 1 Sukuk of Rs 2 billion.\nSome of these stalls are even set up by established food businesses elsewhere in the country.\nFew customers, however, complain of the increase in prices which has dampened their spirits this Ramadan.",
    "MCB Bank PSX": "Corporate Social Responsibility (CSR), reporting on Sustainable Development Goals (SDGs), ESG-related efforts, diversity, and inclusivity are the other key requirements.\n“This market behaviour can be attributed to a cautious approach adopted by investors ahead of monetary policy announcement (scheduled at around 4pm),” he said.\nOn the flip side, Lucky Cement, Systems Limited and MCB Bank saw some profit-taking as they lost 72 points, Topline added.",
    "Meezan Bank PSX": "“It’s a misconception that customers of Sharia-compliant asset management companies (AMCs) will switch to direct investing in Sukuk via their brokerage accounts.\n“This market behaviour can be attributed to a cautious approach adopted by investors ahead of monetary policy announcement (scheduled at around 4pm),” he said.\nOn the flip side, Lucky Cement, Systems Limited and MCB Bank saw some profit-taking as they lost 72 points, Topline added.",
    "National Bank PSX": "In other words, brokers won’t require salary slips or bank statements from potential stock market investors if they choose to open this kind of brokerage accounts.\nMoreover, strong corporate showing especially among the index heavy energy and banking stocks has also improved market sentiments, said experts.\nFurthermore, the caretaker federal cabinet’s approval of a massive hike in gas prices drew strong reactions from across all segments, particularly industrialists.",
    "Standard Chartered Bank PSX": "InfraZamin Pakistan CEO Maheen Rahman said enhancing women’s financial capacity, employment and independence is vital for economic progress.\nThe bank was given permission to establish an exchange company as a subsidiary, just like its rival banks.\nWe remain positive on Pakistan equities, with room for significant gains if elections and a new IMF program are navigated smoothly,” said Intermarket Securities Limited.",
    "SILK Bank PSX": "MCB Bank acquired an additional 30 percent stake in its subsidiary, MCBAH Savings and Investments, at the cost of Rs.\nJS Bank maintained a different strategic position, which will increase its profitability and influence in the banking industry after this deal.\nThe deal can be a win-win situation for both entities in scaling up their business and profitability.",
    "Soneri Bank Limited PSX": "Bank of Punjab remained the volume leader with 47.571 million shares which closed higher by 2 paisas to Rs6.27 per share.\nHR Metrics conducts Pakistan’s most inclusive companies DEI awards - Daily Times HR Metrics conducts Pakistan’s most inclusive companies DEI awards  Daily Times HR Metrics conducts Pakistan’s most inclusive companies DEI awards  Daily Times BAHL announces 115pc profit growth BAHL announces 115pc profit growth  The News International KARACHI: Bank AL Habib Limited (BAHL) on Wednesday reported a 115 percent surge in its annual profit for 2023, driven by higher interest income and fee income.\nSoneri Bank Limited (SNBL) on Wednesday reported a more than threefold increase in its annual profit for 2023, boosted by higher interest income and lower provisions.",
    "United Bank Limited PSX": "Additionally, companies offering robust dividend yields, especially in the banking, energy, and fertiliser sectors, present opportunities for accumulation, noted AKD Securities.\n“This outstanding performance was primarily fueled by higher net interest income and provisioning reversals,” said Arif Habib Limited (AHL) in a note.\n“This market behaviour can be attributed to a cautious approach adopted by investors ahead of monetary policy announcement (scheduled at around 4pm),” he said."
}