[
    {
        "title": "Allied Bank’s profit jumps 95% in 2023",
        "date": "Tue, 13 Feb 2024 08:00:00 GMT",
        "summary": "ABLs board of directors in its meeting also announced a final cash dividend of Rs4 per share i.e. 40 which is in addition to the interim dividend already paid at Rs8 per share i.e. 80. The increase was led by a higher interest rate which rose to 21 in 2023.",
        "stock_ticker": "ABL"
    },
    {
        "title": "ABL profit surges to 41.3bn, marking a 94% increase year-on-year",
        "date": "Tue, 13 Feb 2024 08:00:00 GMT",
        "summary": "Allied Bank Limited ABL has reported a significant yearonyear growth in its financial performance for the year 2023. The bank also experienced growth in its total nonmarkup income which increased by 19.33 to Rs25.6 billion.",
        "stock_ticker": "ABL"
    },
    {
        "title": "Stocks stay bearish ahead of SBP meeting",
        "date": "Sat, 27 Jan 2024 08:00:00 GMT",
        "summary": "Ahsan Mehanti of Arif Habib Corporation said stocks fell on prepoll uncertainty and investor concerns for unresolved power sector circular debt which rose to Rs2.55 trillion in the first half of FY24. Foreign investors indulged in aggressive selling as they disposed of shares worth 10.05m.",
        "stock_ticker": "ABL"
    },
    {
        "title": "Stock Exchange Soars To New All-Time High Of 67,246 Points",
        "date": "Thu, 28 Mar 2024 10:40:50 GMT",
        "summary": "Power banking and fertilizer sectors positively influenced the index with Bank AL Habib Limited BAHL Engro ENGRO Muslim Commercial Bank MCB Pakistan Petroleum Limited PPL and Lucky Cement LUCK collectively contributing 208 points to the bourse which gained a cumulative 594.34 points. Brokerage house Topline Securities said that Thursdays trading session saw robust activity with over 421.02 million shares exchanged at the bourse amounting to a total value of Rs16.1 billion.",
        "stock_ticker": "ABL"
    },
    {
        "title": "Allied Bank Posts Highest Ever Annual Profit of Rs. 41.3 Billion in 2023",
        "date": "Tue, 13 Feb 2024 08:00:00 GMT",
        "summary": "ABL announced earnings PAT today for the calendar year 2023 at Rs. Along with the result ABL announced a final dividend of Rs.",
        "stock_ticker": "ABL"
    },
    {
        "title": "Allied Bank: Record profits",
        "date": "Wed, 14 Feb 2024 08:00:00 GMT",
        "summary": "Allied Bank Limited ABL posted its yearly financial results for CY23 declaring a final cash dividend of Rs4share  taking the fullyear payout to Rs12share. The aftertax profits almost doubled yearonyear despite an effective tax rate in excess of 50 percent.",
        "stock_ticker": "ABL"
    },
    {
        "title": "Banks Allowing Forex Trading in Pakistan [year]",
        "date": "Tue, 26 Mar 2024 13:36:47 GMT",
        "summary": "Before we talk about banks lets first discuss the key factors that must be considered while making your selection. You have to declare your income earned through Forex trading and pay taxes as per rates set by the Federal Board of Revenue FBR.",
        "stock_ticker": "ABL"
    },
    {
        "title": "Equities regain 161 points in volatile trading",
        "date": "Wed, 14 Feb 2024 08:00:00 GMT",
        "summary": "Ahsan Mehanti of Arif Habib Corporation said stocks showed recovery after MSCI a provider of global indices for passive investments added 19 companies to its Frontier Small Cap Index in its latest quarterly index review. Foreign investors remained net buyers as they picked shares worth 0.17m.",
        "stock_ticker": "ABL"
    },
    {
        "title": "These Are the Top 10 Most Profitable Banks in Pakistan",
        "date": "Wed, 28 Feb 2024 08:00:00 GMT",
        "summary": "The bank saw a historically strong gain in profits but its ranking fell from fifth to sixth. The bank was given permission to establish an exchange company as a subsidiary just like its rival banks.",
        "stock_ticker": "ABL"
    },
    {
        "title": "Pakistani Banks that posted highest profits in 2023",
        "date": "Thu, 28 Mar 2024 07:00:00 GMT",
        "summary": "In the year 2023 Pakistans banking sector saw unprecedented growth with performance leading to returns that outpaced Stock Market. United Bank Limited UBL also moves up raking its highestever annual profit of Rs56.47 billion in 2023 marking a 74 percent surge as compared to previous year.",
        "stock_ticker": "ABL"
    },
    {
        "title": "Bank of Khyber to set up exchange company with Rs1bn initial capital",
        "date": "Sun, 05 Nov 2023 07:00:00 GMT",
        "summary": "Read This Big banks are all set to run the open market. The SBP issued noobjection certificate NOC to ABL and MCB for establishing their exchange companies.",
        "stock_ticker": "ABL"
    },
    {
        "title": "Bank AL Habib, Allied Bank receive central bank’s nod to commence Exchange Company operations",
        "date": "Fri, 22 Mar 2024 07:00:00 GMT",
        "summary": "In a notice to the Pakistan Stock Exchange PSX on Friday BAHL stated This refers to our previous announcement at PSX on September 22 2023 regarding the Boards approval to establish an EC as a wholly owned 100 subsidiary of the bank with an authorized share capital of Rs1000 million. Meanwhile a similar notice was issued by ABL to the PSX.",
        "stock_ticker": "ABL"
    },
    {
        "title": "SBP Allows ABL, Bank Al Habib to Start Their Currency Exchange Operations",
        "date": "Fri, 22 Mar 2024 07:00:00 GMT",
        "summary": "Meanwhile a similar notice was issued by Bank Al Habib to the bourse. This refers to our previous announcement at PSX on September 22 2023 regarding the Boards approval to establish an EC as a wholly owned 100 subsidiary of the bank with an authorized share capital of Rs.",
        "stock_ticker": "ABL"
    },
    {
        "title": "Exchange companies: SBP gives NOCs to Allied Bank, MCB Bank",
        "date": "Sat, 28 Oct 2023 07:00:00 GMT",
        "summary": "KARACHI The State Bank of Pakistan SBP has issued the noobjection certificate NOC to Allied Bank Limited for establishing an exchange company in the name of ABL Exchange Company Private Limited. Both the banks informed this through separate material information sent to Pakistan Stock Exchange on Friday.",
        "stock_ticker": "ABL"
    },
    {
        "title": "Askari Bank to Set Up Exchange Company",
        "date": "Fri, 27 Oct 2023 07:00:00 GMT",
        "summary": "Askari Bank Limited PSX AKBL is set to establish an Exchange Company with an authorized capital of Rs. The notice also highlighted that the Exchange Company will be a whollyowned subsidiary of AKBL.",
        "stock_ticker": "ABL"
    },
    {
        "title": "KSE-100 stages dramatic recovery after falling below 60k",
        "date": "Tue, 13 Feb 2024 08:00:00 GMT",
        "summary": "Indexheavy energy stocks including OGDC PPL PSO and SNGP however were still in the red. Although there is no positive development on the economic front strong corporate results are acting as a support factor Sana Tawfik an analyst at AHL told Business Recorder.",
        "stock_ticker": "ABL"
    }
]