[
    {
        "title": "Askari Bank latest to establish wholly-owned Exchange Company",
        "date": "Fri, 27 Oct 2023 07:00:00 GMT",
        "summary": "Askari Bank Limited a subsidiary of Fauji Foundation announced on Friday it will establish an Exchange Company EC as a whollyowned subsidiary becoming the eighth banking entity to make such an announcement to date. This EC shall be a wholly owned subsidiary of AKBL it added.",
        "stock_ticker": "AKBL"
    },
    {
        "title": "PSX rallies in first week of 2024",
        "date": "Sun, 07 Jan 2024 08:00:00 GMT",
        "summary": "Moreover positive economic indicators were evident as the Federal Board of Revenue achieved a historic onemonth tax collection of Rs984bn coupled with a substantial 40.1 per cent yearonyear reduction in the trade deficit for December 2023. Additionally companies offering robust dividend yields especially in the banking energy and fertiliser sectors present opportunities for accumulation noted AKD Securities.",
        "stock_ticker": "AKBL"
    },
    {
        "title": "What’s up at the stock market? A rebuttal",
        "date": "Sun, 31 Dec 2023 08:00:00 GMT",
        "summary": "However this does not mean that the index has only increased due to movement in these two sectors. Pakistan is able to get investments from outside its own borders where foreigners can trade in the stock market.",
        "stock_ticker": "AKBL"
    },
    {
        "title": "Askari Bank records Rs21.5bn profit in 2023 - Daily Times",
        "date": "Thu, 22 Feb 2024 08:00:00 GMT",
        "summary": "Askari Bank records Rs21.5bn profit in 2023  Daily Times",
        "stock_ticker": "AKBL"
    },
    {
        "title": "Askari Bank announces to establish wholly-owned Exchange Company",
        "date": "Fri, 27 Oct 2023 07:00:00 GMT",
        "summary": "Askari Bank Limited has announced the establishment of an Exchange Company EC as a whollyowned subsidiary. In light of these reforms commercial banks engaged in foreign exchange business started the process of establishing whollyowned EC to cater to the needs of the public at large.",
        "stock_ticker": "AKBL"
    },
    {
        "title": "Askari Bank to Set Up Exchange Company",
        "date": "Fri, 27 Oct 2023 07:00:00 GMT",
        "summary": "Askari Bank Limited PSX AKBL is set to establish an Exchange Company with an authorized capital of Rs. The notice also highlighted that the Exchange Company will be a whollyowned subsidiary of AKBL.",
        "stock_ticker": "AKBL"
    },
    {
        "title": "UBL profits soar 76 percent in 2023, pays out 440 percent dividend",
        "date": "Thu, 22 Feb 2024 08:00:00 GMT",
        "summary": "KARACHI United Bank Limited Pakistans secondlargest private bank posted a record annual profit of Rs56.47 billion for 2023 up 76.1 percent from a year earlier as it benefited from high interest rates and lower provisions. The bank attributed its strong performance to proactive actions to manage businesses a clientfocused strategy emphasis on technology effective cost controls rationalization of human resource and excellent performance of its Islamic banking subsidiary Ikhlas Islamic Banking.",
        "stock_ticker": "AKBL"
    },
    {
        "title": "PSX drops 532 points as volatility continues to dominate",
        "date": "Tue, 16 Jan 2024 08:00:00 GMT",
        "summary": "Pakistan Stock Exchange PSX witnessed a volatile trading session on Tuesday as the benchmark KSE100 Index dropped by 531.91 points or 0.83 to close at 63737.46 level. In the fertilizer sector Engro Corporations share price decreased by 3.64 and Fauji Fertilizer Bin Qasim showed an increase in share price of just 0.08 despite a high shares trading volume of 4661944.",
        "stock_ticker": "AKBL"
    },
    {
        "title": "MSCI adds 22 Pakistan firms to frontier market index",
        "date": "Wed, 14 Feb 2024 08:00:00 GMT",
        "summary": "KARACHI The stock market is likely to receive a boost as MSCI Inc. on Tuesday announced the inclusion of 22 Pakistani companies in its Frontier Market and Small Cap indexes effective from Feb. 29. Due to this adjustment we anticipate some net flows although the quantum will not be significant.",
        "stock_ticker": "AKBL"
    },
    {
        "title": "Pakistan’s stock market witnesses lackluster week",
        "date": "Sat, 03 Feb 2024 08:00:00 GMT",
        "summary": "Pakistans stock market witnessed a lackluster week as trading volumes dropped by 25 and the benchmark KSE100 Index lost 1.27 of its value. According to a note by AKD Research average trading volumes remained down by 24.7 weekonweek clocking in at 312.8 million shares compared to 415.8 million shares traded in the past week.",
        "stock_ticker": "AKBL"
    },
    {
        "title": "Here’s What Happened in Pakistan’s Banking Sector in 2023",
        "date": "Thu, 21 Dec 2023 08:00:00 GMT",
        "summary": "MCB Bank acquired an additional 30 percent stake in its subsidiary MCBAH Savings and Investments at the cost of Rs. JS Bank maintained a different strategic position which will increase its profitability and influence in the banking industry after this deal.",
        "stock_ticker": "AKBL"
    },
    {
        "title": "MSCI adds 19 Pakistani companies to Small Cap, 3 to Frontier Markets Indexes",
        "date": "Wed, 14 Feb 2024 08:00:00 GMT",
        "summary": "In a positive development Morgan Stanley Capital International MSCI Inc. in its results of the February 2024 index review announced the addition of 22 Pakistani companies as constituents on its Frontier Market FM Index and FM Small Cap Indexes. Due to this adjustment we anticipate some net flows although the quantum will not be significant it added.",
        "stock_ticker": "AKBL"
    }
]