[
    {
        "title": "CCP approves Bank Alfalah’s acquisition of shares in QistBazaar",
        "date": "Wed, 18 Oct 2023 07:00:00 GMT",
        "summary": "Bank Alfalah Limited as per Advance Against Share Agreement. All requisite informationdocumentation pertaining to the Application was completed on 4th October 2023. According to CCP it will also open up a new online market for consumers enhancing competition with retailers across the region.",
        "stock_ticker": "BAFL"
    },
    {
        "title": "Bank Alfalah intends to acquire majority stake in Samba Bank",
        "date": "Fri, 29 Mar 2024 07:00:00 GMT",
        "summary": "Bank Alfalah informed the Pakistan Stock Exchange PSX through a notice on Friday that it has made a nonbinding indicative offer to Saudi National Bank the majority shareholder of Samba Bank Limited to acquire their 100 stake in Samba which constitutes approximately 84.51 shares. SNB has responded positively expressing willingness to consider Bank Alfalahs proposal.",
        "stock_ticker": "BAFL"
    },
    {
        "title": "Bank Alfalah doubles annual profit, boosts dividend",
        "date": "Fri, 02 Feb 2024 08:00:00 GMT",
        "summary": "Moving forward the Bank is looking to enhance its customers experience further while leveraging core competencies. Pakistan Refinery Limited PRL reported a sevenandahalffold increase in its halfyear net profit on Thursday boosted by higher sales and production of refined products.",
        "stock_ticker": "BAFL"
    },
    {
        "title": "Oil sector leads gains on stock market",
        "date": "Thu, 25 Jan 2024 08:00:00 GMT",
        "summary": "Todays rally can be attributed to Oil and Gas Development Company Ltd Bank AlHabib Ltd Bank Alfalah Attock Petroleum Ltd and HabibMetro Bank as they collectively contributed 298 points to the indexs positive performance.Ahsan Mehanti of Arif Habib Corporation said stocks closed bullish led by the oil sector on investor speculations about the governments resolve to settle power sector circular debt. He added that the rupees appreciation and expectations of a status quo in the SBPs upcoming monetary policy meeting on Jan 29 also helped stocks extend their overnight gains.",
        "stock_ticker": "BAFL"
    },
    {
        "title": "Bank Alfalah records an impressive profit growth",
        "date": "Mon, 30 Oct 2023 07:00:00 GMT",
        "summary": "Responding to everchanging business dynamics we are expediting our digital transformation journey. The Bank also opened Pakistans first Digital Lifestyle branch in 2023 and is looking to further enhance our customers experience by accelerating digital adoption while leveraging our core competencies.",
        "stock_ticker": "BAFL"
    },
    {
        "title": "What’s up at the stock market? A rebuttal",
        "date": "Sun, 31 Dec 2023 08:00:00 GMT",
        "summary": "However this does not mean that the index has only increased due to movement in these two sectors. Pakistan is able to get investments from outside its own borders where foreigners can trade in the stock market.",
        "stock_ticker": "BAFL"
    },
    {
        "title": "Cement maker completes biggest share buyback",
        "date": "Wed, 22 Nov 2023 08:00:00 GMT",
        "summary": "KARACHI Lucky Cement Ltd has completed a second share buyback exercise representing 6.5 per cent of its paidup capital at spot prices the company said on Tuesday. According to data compiled by Arif Habib Ltd the cement makers average purchase price was Rs632.60 per share for 20.375 million shares that it bought between June 2 and Nov 20.",
        "stock_ticker": "BAFL"
    },
    {
        "title": "Bank Alfalah’s eyes majority stake in Samba Bank Limited",
        "date": "Fri, 29 Mar 2024 06:13:32 GMT",
        "summary": "The bank shared that the acquisition is subject to satisfactory due diligence execution of definitive agreements internal corporate approvals obtaining all necessary regulatory approvals and compliance with all applicable legal and regulatory procedures including compliance with the Securities Act 2015 and associated regulations. SNB has agreed to evaluate the nonbinding offer and will subject to compliance with requirements under applicable law including execution of nondisclosure agreement issuance of public announcement of intention by Bank Alfalah Limited under the Securities Act 2015 and approval from the SBP invite Bank Alfalah Limited to conduct diligence on Samba Pakistan SNB notice read.",
        "stock_ticker": "BAFL"
    },
    {
        "title": "PSX drops 532 points as volatility continues to dominate",
        "date": "Tue, 16 Jan 2024 08:00:00 GMT",
        "summary": "Pakistan Stock Exchange PSX witnessed a volatile trading session on Tuesday as the benchmark KSE100 Index dropped by 531.91 points or 0.83 to close at 63737.46 level. In the fertilizer sector Engro Corporations share price decreased by 3.64 and Fauji Fertilizer Bin Qasim showed an increase in share price of just 0.08 despite a high shares trading volume of 4661944.",
        "stock_ticker": "BAFL"
    },
    {
        "title": "Stocks hit record high as PIA steps closer to privatisation",
        "date": "Thu, 28 Mar 2024 07:00:00 GMT",
        "summary": "KARACHI Strong international interest following significant progress towards privatisation of the national flag carrier and optimism about IMF inflows early next month further boosted investor confidence triggering a fresh buying spree tossing the benchmark KSE 100share index to an alltime high closing above 66500 level. On the other hand Pakistan Petroleum National Bank and Millat Tractors attracted some profittaking wiping out 67 points.",
        "stock_ticker": "BAFL"
    },
    {
        "title": "Bank Alfalah’s profit jumps over 96% in 2023",
        "date": "Thu, 01 Feb 2024 08:00:00 GMT",
        "summary": "Bank Alfalah has posted a consolidated profit after tax of Rs36.09 billion during the year 2023 which is over 96 higher than its earnings in the preceding year. The net interest income of Bank Alfalah amounted to Rs125.95 billion in 2023 up 63 from a year ago as compared to Rs77.17 billion registered in SPLY.",
        "stock_ticker": "BAFL"
    },
    {
        "title": "Bank Alfalah has pumped Rs 1.2 billion into its brokerage subsidiary. Why now?",
        "date": "Fri, 22 Mar 2024 07:00:00 GMT",
        "summary": "in fact due to the loss made this year Alfalah CLSA saw its equity turn negative. 1.2 billion would be channeled towards purchasing and subscribing additional shares of the brokerage house at Rs.",
        "stock_ticker": "BAFL"
    },
    {
        "title": "Record-breaking rally halts at PSX",
        "date": "Sat, 30 Mar 2024 04:19:55 GMT",
        "summary": "However trading remained range bound as the finance minister indicated that next fiscal years budget may not be progrowth. The finance minister hinted at a reduction in development spending and energy sector reforms ahead of PakistanIMF talks on April 1415.",
        "stock_ticker": "BAFL"
    },
    {
        "title": "Stocks settle above 64,000 on election eve",
        "date": "Thu, 08 Feb 2024 08:00:00 GMT",
        "summary": "The traded value also dipped by 5.83pc to Rs14.30bn on a dayonday basis. Foreign investors remained net buyers as they purchased shares worth 1.41m.",
        "stock_ticker": "BAFL"
    },
    {
        "title": "Bulls add 381 points to overnight gains",
        "date": "Wed, 27 Mar 2024 07:00:00 GMT",
        "summary": "Oil and Gas Development Company Ltd informed the PSX that it has discovered hydrocarbon reserves at Togh02 well in Kohat Khyber Pakhtunkhwa. The fertiliser banking and cement sectors with Fauji Fertiliser Company Meezan Bank Ltd United Bank Ltd Lucky Cement and Engro Corporation collectively added 305 points to the index.",
        "stock_ticker": "BAFL"
    }
]