[
    {
        "title": "Another Record: Stock Exchange Surges To Unprecedented Heights, Breezes Past 56,000 Points",
        "date": "Mon, 13 Nov 2023 08:00:00 GMT",
        "summary": "The Pakistan Stock Exchange continued its positive momentum from the last week as it gained another 1132.22 points on Monday to surge past another major psychological barrier of 56000 points. The index opened on Monday morning at 55391.36 points.",
        "stock_ticker": "BAHL"
    },
    {
        "title": "Bank AL Habib launches currency exchange subsidiary",
        "date": "Tue, 26 Mar 2024 07:00:00 GMT",
        "summary": "Bank AL Habib Limited BAHL has officially started operations of its fully owned subsidiary Al Habib Exchange Company Private Limited today. The approval for this new venture was initially confirmed on September 22 2023 after the banks board sanctioned the creation of an Exchange Company with a declared share capital of Rs1 billion.",
        "stock_ticker": "BAHL"
    },
    {
        "title": "Bank AL Habib declares 50pc final cash dividend",
        "date": "Thu, 07 Mar 2024 08:00:00 GMT",
        "summary": "KARACHI The Annual General Meeting of Bank AL Habib Limited was held at Banks premises located at 128C Old Bahawalpur Road Multan on Wednesday. This final Dividend is in addition to 90 percent interim cash dividends paid earlier thus making a total of 140 percent i.e. Rs.",
        "stock_ticker": "BAHL"
    },
    {
        "title": "BAHL announces 115pc profit growth",
        "date": "Thu, 01 Feb 2024 08:00:00 GMT",
        "summary": "Soneri Bank Limited SNBL on Wednesday reported a more than threefold increase in its annual profit for 2023 boosted by higher interest income and lower provisions. The banks total nonmarkup expenses which include administrative and operating costs rose by 26.4 percent to Rs15.47 billion in 2023 from Rs12.24 billion in 2022 mainly due to inflation and business expansion.",
        "stock_ticker": "BAHL"
    },
    {
        "title": "Bank Al Habib Records Highest-Ever Annual Profit",
        "date": "Wed, 31 Jan 2024 08:00:00 GMT",
        "summary": "According to Arif Habib Limited BAHL has achieved a historic milestone by recording the highestever profitability of Rs. ALSO READ SBP Asks Authorized Dealers To Process Import Payments With Due Diligence",
        "stock_ticker": "BAHL"
    },
    {
        "title": "Bank AL Habib, Allied Bank receive central bank’s nod to commence Exchange Company operations",
        "date": "Fri, 22 Mar 2024 07:00:00 GMT",
        "summary": "In a notice to the Pakistan Stock Exchange PSX on Friday BAHL stated This refers to our previous announcement at PSX on September 22 2023 regarding the Boards approval to establish an EC as a wholly owned 100 subsidiary of the bank with an authorized share capital of Rs1000 million. Meanwhile a similar notice was issued by ABL to the PSX.",
        "stock_ticker": "BAHL"
    },
    {
        "title": "What’s up at the stock market? A rebuttal",
        "date": "Sun, 31 Dec 2023 08:00:00 GMT",
        "summary": "However this does not mean that the index has only increased due to movement in these two sectors. Pakistan is able to get investments from outside its own borders where foreigners can trade in the stock market.",
        "stock_ticker": "BAHL"
    },
    {
        "title": "Habib Metropolitan Bank says it will establish wholly-owned EC",
        "date": "Tue, 10 Oct 2023 07:00:00 GMT",
        "summary": "The Board of Directors of Habib Metropolitan Bank HMB a subsidiary of Habib Bank AG Zurich  Switzerland announced on Tuesday that it will establish an Exchange Company EC as a whollyowned subsidiary becoming the seventh banking entity to make such an announcement to date. This EC shall be a wholly owned subsidiary of Habib Metropolitan Bank Limited it added.",
        "stock_ticker": "BAHL"
    }
]