[
    {
        "title": "BankIslami records 137% jump in profit during 2023",
        "date": "Wed, 28 Feb 2024 08:00:00 GMT",
        "summary": "This is in addition to the interim cash dividend already paid at Rs1.75 per share i.e. 17.5. BIPL generated Rs1.8 billion in fee and commission income up over 24 as compared to the same period last year.",
        "stock_ticker": "BIPL"
    },
    {
        "title": "BankIslami full-year profit soars 137pc",
        "date": "Thu, 29 Feb 2024 08:00:00 GMT",
        "summary": "HABIBMETRO Bank Ltd reported an 88 percent jump in its pretax profit for 2023 driven by higher core earnings and improved margins. We are grateful for the blessings of the Almighty as we have surpassed PKR 1 trillion in deposits and achieved a 71 percent increase in profitability this year said Khurram Shahzad Khan president and chief executive officer of HABIBMETRO.",
        "stock_ticker": "BIPL"
    },
    {
        "title": "PSX suspends shares’ trading of three companies",
        "date": "Fri, 19 Jan 2024 08:00:00 GMT",
        "summary": "According to notices issued on Friday these companies failed to comply with the regulatory clauses 5.11.1 of PSX regulation that falls under the heading of defaulters segment suspension and delisting. Clause 5.11.1 c of the PSX regulations suggests that a company should hold one annual general meeting and clause 5.11.1 d suggests that a company should submit its annual audited accounts for the preceding financial year.",
        "stock_ticker": "BIPL"
    },
    {
        "title": "Islamic banks brace for minimum deposit rate",
        "date": "Tue, 28 Nov 2023 08:00:00 GMT",
        "summary": "KARACHI Share prices of Islamic banks took a beating on Monday thanks to Finance Minister Dr Shamshad Akhtars recent statement that customers are getting shortchanged by Shariacompliant lenders by way of insufficient returns on deposits. A research report written by JS Global Head of Research Amreen Soorani stated that Islamic banks are currently offering savings rates that are between seven and 9.5 percentage points lower than the MDR offered by conventional banks.",
        "stock_ticker": "BIPL"
    },
    {
        "title": "BankIslami's Ehad Sukuk II listed on PSX with gong ceremony - Daily Times",
        "date": "Thu, 21 Mar 2024 07:00:00 GMT",
        "summary": "BankIslamis Ehad Sukuk II listed on PSX with gong ceremony  Daily Times",
        "stock_ticker": "BIPL"
    },
    {
        "title": "MSCI adds 22 Pakistan firms to frontier market index",
        "date": "Wed, 14 Feb 2024 08:00:00 GMT",
        "summary": "KARACHI The stock market is likely to receive a boost as MSCI Inc. on Tuesday announced the inclusion of 22 Pakistani companies in its Frontier Market and Small Cap indexes effective from Feb. 29. Due to this adjustment we anticipate some net flows although the quantum will not be significant.",
        "stock_ticker": "BIPL"
    },
    {
        "title": "Cherat Cement Authorized to Invest Rs. 75 Million in Mirpurkhas Sugar Mills Ltd",
        "date": "Thu, 21 Mar 2024 07:00:00 GMT",
        "summary": "ALSO READ PSX Marks Listing of BankIslami Pakistans Ehad Sukuk II with Gong Ceremony Cherats main business activity is manufacturing marketing and sale of cement.",
        "stock_ticker": "BIPL"
    },
    {
        "title": "MSCI adds 19 Pakistani companies to Small Cap, 3 to Frontier Markets Indexes",
        "date": "Wed, 14 Feb 2024 08:00:00 GMT",
        "summary": "In a positive development Morgan Stanley Capital International MSCI Inc. in its results of the February 2024 index review announced the addition of 22 Pakistani companies as constituents on its Frontier Market FM Index and FM Small Cap Indexes. Due to this adjustment we anticipate some net flows although the quantum will not be significant it added.",
        "stock_ticker": "BIPL"
    },
    {
        "title": "KSE-100’s unstoppable surge tops historic 66,000 mark",
        "date": "Sat, 09 Dec 2023 08:00:00 GMT",
        "summary": "This will also help diversify government funding sources boost Islamic finance and develop a Shariacompliant capital market. Mohammed Sohail Chief Executive of Karachibased brokerage firm Topline Securities attributed the bull run to declining oil prices and continuous foreign buying.",
        "stock_ticker": "BIPL"
    },
    {
        "title": "Here’s What Happened in Pakistan’s Banking Sector in 2023",
        "date": "Thu, 21 Dec 2023 08:00:00 GMT",
        "summary": "MCB Bank acquired an additional 30 percent stake in its subsidiary MCBAH Savings and Investments at the cost of Rs. JS Bank maintained a different strategic position which will increase its profitability and influence in the banking industry after this deal.",
        "stock_ticker": "BIPL"
    }
]