[
    {
        "title": "Stocks lose 753 points on lack of triggers",
        "date": "Thu, 14 Mar 2024 07:00:00 GMT",
        "summary": "The traded value also dipped 14.82pc to Rs9.24bn on a dayonday basis. Aggressive buying by foreign investors continued as they purchased shares worth 2.53m.",
        "stock_ticker": "BOP"
    },
    {
        "title": "What’s up at the stock market? A rebuttal",
        "date": "Sun, 31 Dec 2023 08:00:00 GMT",
        "summary": "However this does not mean that the index has only increased due to movement in these two sectors. Pakistan is able to get investments from outside its own borders where foreigners can trade in the stock market.",
        "stock_ticker": "BOP"
    },
    {
        "title": "PSX loses 228 points",
        "date": "Wed, 29 Nov 2023 08:00:00 GMT",
        "summary": "A total of 692220122 shares valuing Rs 27.039 billion were traded during the day as compared to 779671060 shares valuing Rs26.138 billion the last day. Some 387 companies transacted their shares in the stock market 143 of them recorded gains and 231 sustained losses whereas the share prices of 13 remained unchanged.",
        "stock_ticker": "BOP"
    },
    {
        "title": "Shares at PSX plummet over 900 points",
        "date": "Mon, 18 Dec 2023 08:00:00 GMT",
        "summary": "According to analysts anxiety over the strained rupee position amid rising demand and poor inflows of dollars has increased. Amreen Soorani head of research at JS Global noted that the index had rallied by more than 60pc this year.",
        "stock_ticker": "BOP"
    },
    {
        "title": "PSX seeks clarification from 19 companies on unusual share price movement",
        "date": "Thu, 21 Dec 2023 08:00:00 GMT",
        "summary": "The Pakistan Stock Exchange PSX has sought clarification from 19 companies to explain the unusual movements in their share prices and volumes. Following the PSX letter Sapphire Fibres Limited Samba Bank Pakistan National Shipping Corporation GEMUNSL First Punjab Modaraba and Agritech Limited said on December 21 that they did not know of any cause significant information that could have led to the abnormal change in market price or volume during the specified time period.",
        "stock_ticker": "BOP"
    },
    {
        "title": "Stocks tumble 925 points on profit-taking",
        "date": "Tue, 19 Dec 2023 08:00:00 GMT",
        "summary": "According to Arif Habib Corporation analyst Ahsan Mehanti institutions booked profit in overbought scrips amid a slump in global crude prices and concerns about the fate of structural reforms postgeneral elections. Foreign investors were net buyers as they purchased shares worth 1.2m.",
        "stock_ticker": "BOP"
    },
    {
        "title": "Stocks suffer biggest-ever plunge of 2,534 points",
        "date": "Wed, 27 Dec 2023 08:00:00 GMT",
        "summary": "Citing data from the morning of Tuesday Mr Sohail said futures contracts for December amounted to more than Rs20bn. The categories of investors who bought up shares in large quantities were banks 4.5m brokers 2.9m and insurance firms 1m.",
        "stock_ticker": "BOP"
    },
    {
        "title": "Relentless PSX surges past 60,000 milestone",
        "date": "Wed, 29 Nov 2023 08:00:00 GMT",
        "summary": "Of all PSXlisted shares worth roughly 30 billion holdings by foreign investors currently account for 1.3bn or 4.3pc. I expect the KSE100 index to hit 75000 points by December 2024 said Mr Sohail.",
        "stock_ticker": "BOP"
    },
    {
        "title": "Stocks rally 612 points on steady policy rate",
        "date": "Wed, 20 Mar 2024 07:00:00 GMT",
        "summary": "Topline Securities Ltd said the KSE100 index opened on a positive note as it gained 734.22 points in early trade. Furthermore whispers of institutional buying circulated casting a favourable light on the market and contributing to its upward momentum.",
        "stock_ticker": "BOP"
    },
    {
        "title": "PSX closes in green, gains by 140 points",
        "date": "Wed, 25 Oct 2023 07:00:00 GMT",
        "summary": "By close however the index settled 149.19 points or 0.29pc ahead. However the index experienced minor losses on Tuesday as investors decided to offload.",
        "stock_ticker": "BOP"
    },
    {
        "title": "Stocks finish weekend session on bearish note",
        "date": "Sat, 16 Mar 2024 07:00:00 GMT",
        "summary": "On the other hand Oil and Gas Development Company Hub Power Pakistan Petroleum Ltd Bank AlHabib United Bank Ltd and PSO wiped out 179 points. The traded value also declined 3.49pc to Rs10.12bn on a dayonday basis.",
        "stock_ticker": "BOP"
    },
    {
        "title": "Stocks extend overnight rally on IMF pact",
        "date": "Thu, 21 Mar 2024 07:00:00 GMT",
        "summary": "KARACHI Reaching a StaffLevel Agreement SLA with the International Monetary Fund IMF and strong current account data boosted investors sentiment as a result the benchmark KSE 100share index extended its overnight bull run. Fertiliser and banking sectors contributed positively to the index as Fauji Fertiliser Company Meezan Bank Ltd National Bank of Pakistan Packages Ltd and Engro Corporation added 151 points cumulatively.",
        "stock_ticker": "BOP"
    },
    {
        "title": "Stocks falter as weak economic outlook haunts",
        "date": "Fri, 22 Mar 2024 07:00:00 GMT",
        "summary": "Ahsan Mehanti of Arif Habib Corporation said the government increased the return on three and 12month Tbills by up to 60 basis points while the foreign direct investment tumbled 17.1pc to 820.6m for JulyFebruary reflecting serious challenges over external financing which contributed to bearish market sentiments. On the global landscape the US central banks Federal Open Market Committee kept its benchmark rate in a range of 5.25pc to 5.5pc by maintaining the status quo in its interest rates decision while giving signal to three cuts in CY24.",
        "stock_ticker": "BOP"
    },
    {
        "title": "Index falls below 51,000 amid rate speculations",
        "date": "Sat, 28 Oct 2023 07:00:00 GMT",
        "summary": "The traded value also dipped 2.9pc to Rs10.6bn on a dayonday basis. Foreign investors were net buyers as they purchased shares worth 0.39m.",
        "stock_ticker": "BOP"
    },
    {
        "title": "CORPORATE WINDOW: Conversion towards Islamic finance",
        "date": "Mon, 20 Nov 2023 08:00:00 GMT",
        "summary": "This signifies a significant shift towards embracing Islamic finance principles in the countrys financial engagements. This transformation is an unprecedented milestone in Pakistans banking history where a large conventional institution embraced Shariahcompliant principles.",
        "stock_ticker": "BOP"
    }
]