[
    {
        "title": "HBL Power soars 8%, hits new high on healthy outlook; up 208% in 6 months",
        "date": "Wed, 11 Oct 2023 07:00:00 GMT",
        "summary": "Shares of HBL Power Systems hit a record high of Rs 309.80 as they rallied 8 per cent on the BSE in Wednesdays intraday trade on healthy business outlook. The stock of auto components  equipments company surpassed its previous high of Rs 294.90 touched on August 24 2023.In past six months the stock price of HBL Power has zoomed 208 per cent as compared to nearly 11 per cent rise in the SP BSE Sensex.The principal activities of the HBL Power comprise of manufacturing of different types of batteries including lead acid nicad silver zinc",
        "stock_ticker": "HBL"
    },
    {
        "title": "Hub Power to acquire 9.5% shares of Sindh Engro Coal Mining Company",
        "date": "Fri, 16 Feb 2024 08:00:00 GMT",
        "summary": "In a bid to expand its footprint in the energy sector the Hub Power Company Limited has entered into a definitive agreement for the acquisition of shares of Sindh Engro Coal Mining Company Limited SECMC. According to a notice sent to the Pakistan Stock Exchange this acquisition is equivalent to approximately 9.5 of the issued and paidup ordinary share capital of SECMC currently held by Habib Bank Limited HBL.",
        "stock_ticker": "HBL"
    },
    {
        "title": "Treet : Right Issue (Final Offering Document) -October 30, 2023 at 01:25 am EDT",
        "date": "Mon, 30 Oct 2023 07:00:00 GMT",
        "summary": "Name of the Designation Contact Office Address Email ID Person Number Muhammad Group Chief 04232590701 72BQuaideAzam Industrial Area mohtashim.aftab 1. Mohtashim Financial Officer Ext 222 Kot Lakhpat Lahore treetgroup.com Aftab Underwriters Habib Bank Syed Khurram Head ECM  02133116507 24th floor  HBL Tower Plot  G4 Khurram.shahidhbl.c Limited Shahid Advisory Block 7 Clifton Karachi om",
        "stock_ticker": "HBL"
    },
    {
        "title": "HBL Power Systems Q3 FY24 Results Live : profit rise by 232.89% YOY",
        "date": "Sat, 10 Feb 2024 08:00:00 GMT",
        "summary": "HBL Power Systems declared their Q3 FY24 results on 07 Feb 2024. From insightful newsletters to realtime stock tracking breaking news and a personalized newsfeed  its all here just a click away",
        "stock_ticker": "HBL"
    },
    {
        "title": "HBL Power Standalone December 2023 Net Sales at Rs 594.60 crore, up 80.73% Y-o-Y",
        "date": "Wed, 07 Feb 2024 08:00:00 GMT",
        "summary": "You are already a Moneycontrol Pro user.",
        "stock_ticker": "HBL"
    },
    {
        "title": "Pakistani Banks that posted highest profits in 2023",
        "date": "Thu, 28 Mar 2024 07:00:00 GMT",
        "summary": "In the year 2023 Pakistans banking sector saw unprecedented growth with performance leading to returns that outpaced Stock Market. United Bank Limited UBL also moves up raking its highestever annual profit of Rs56.47 billion in 2023 marking a 74 percent surge as compared to previous year.",
        "stock_ticker": "HBL"
    },
    {
        "title": "HBL Power Systems consolidated net profit rises 232.94% in the December 2023 quarter",
        "date": "Wed, 07 Feb 2024 08:00:00 GMT",
        "summary": "Disclaimer No Business Standard Journalist was involved in creation of this content Net profit of HBL Power Systems rose 232.94 to Rs 79.04 crore in the quarter ended December 2023 as against Rs 23.74 crore during the previous quarter ended December 2022.",
        "stock_ticker": "HBL"
    },
    {
        "title": "Pakistan's HBL CEO Aurangzeb resigns from bank, letter to bourse shows",
        "date": "Mon, 11 Mar 2024 11:45:00 GMT",
        "summary": "KARACHI Pakistan March 11 Reuters  Pakistans HBL President and CEO Muhammad Aurangzeb resigned from his position as leader of the countrys largest bank HBL said in a letter to the stock exchange shortly after Aurangzeb took an oath to join the government as a minister. Mr. Muhammad Aurangzeb has tendered his resignation to the Board of Directors of Habib Bank Limited HBL and shall step down as President and Chief Executive Officer of HBL.",
        "stock_ticker": "HBL"
    },
    {
        "title": "Investors Shouldn't Overlook HBL Power Systems' (NSE:HBLPOWER) Impressive Returns On Capital",
        "date": "Sat, 09 Dec 2023 08:00:00 GMT",
        "summary": "If you want to delve into the historical earnings revenue and cash flow of HBL Power Systems check out these free . This tells us that HBL Power Systems has grown its returns without a reliance on increasing their current liabilities which were very happy with.",
        "stock_ticker": "HBL"
    },
    {
        "title": "We Think HBL Power Systems (NSE:HBLPOWER) Can Stay On Top Of Its Debt",
        "date": "Sat, 06 Jan 2024 08:00:00 GMT",
        "summary": "But the stark truth is that we are concerned by its conversion of EBIT to free cash flow. When all is said and done sometimes its easier to focus on companies that dont even need debt.",
        "stock_ticker": "HBL"
    },
    {
        "title": "Private companies invested in HBL Power Systems Limited (NSE:HBLPOWER) copped the brunt of last week's ₹6.1b market cap decline",
        "date": "Tue, 27 Feb 2024 08:00:00 GMT",
        "summary": "Lets take a closer look to see what the different types of shareholders can tell us about HBL Power Systems. Since institutions own only a small portion of HBL Power Systems many may not have spent much time considering the stock.",
        "stock_ticker": "HBL"
    },
    {
        "title": "HBL Power Systems Third Quarter 2024 Earnings: EPS: ₹2.84 (vs ₹0.83 in 3Q 2023)",
        "date": "Fri, 09 Feb 2024 08:00:00 GMT",
        "summary": "Find out whether HBL Power Systems is potentially over or undervalued by checking out our comprehensive analysis which includes fair value estimates risks and warnings dividends insider transactions and financial health. Note that our analysis may not factor in the latest pricesensitive company announcements or qualitative material.",
        "stock_ticker": "HBL"
    },
    {
        "title": "Investors Shouldn't Overlook HBL Power Systems' (NSE:HBLPOWER) Impressive Returns On Capital",
        "date": "Thu, 04 Apr 2024 00:35:18 GMT",
        "summary": "Speaking of which we noticed some great changes in HBL Power Systems   returns on capital so lets have a look. The increasing returns on a growing amount of capital is common amongst multibaggers and thats why were impressed.",
        "stock_ticker": "HBL"
    },
    {
        "title": "Is Now The Time To Put HBL Power Systems (NSE:HBLPOWER) On Your Watchlist?",
        "date": "Thu, 25 Jan 2024 08:00:00 GMT",
        "summary": "But the reality is that when a company loses money each year for long enough its investors will usually take their share of those losses. So it is good to see that HBL Power Systems insiders have a significant amount of capital invested in the stock.",
        "stock_ticker": "HBL"
    }
]