[
    {
        "title": "Habib Metropolitan Bank : Corporate Briefing Session - Habib Metropolitan Bank Limited -March 22, 2024 at 03:26 am EDT",
        "date": "Fri, 22 Mar 2024 07:26:02 GMT",
        "summary": "This segment includes loans deposits and other transactions with retail customers. The Bank operates with approximately 500 branches in about 200 cities across Pakistan.",
        "stock_ticker": "HMB"
    },
    {
        "title": "What’s up at the stock market? A rebuttal",
        "date": "Sun, 31 Dec 2023 08:00:00 GMT",
        "summary": "However this does not mean that the index has only increased due to movement in these two sectors. Pakistan is able to get investments from outside its own borders where foreigners can trade in the stock market.",
        "stock_ticker": "HMB"
    },
    {
        "title": "Habib Metropolitan Bank says it will establish wholly-owned EC",
        "date": "Tue, 10 Oct 2023 07:00:00 GMT",
        "summary": "The Board of Directors of Habib Metropolitan Bank HMB a subsidiary of Habib Bank AG Zurich  Switzerland announced on Tuesday that it will establish an Exchange Company EC as a whollyowned subsidiary becoming the seventh banking entity to make such an announcement to date. This EC shall be a wholly owned subsidiary of Habib Metropolitan Bank Limited it added.",
        "stock_ticker": "HMB"
    },
    {
        "title": "BAHL announces 115pc profit growth",
        "date": "Thu, 01 Feb 2024 08:00:00 GMT",
        "summary": "Soneri Bank Limited SNBL on Wednesday reported a more than threefold increase in its annual profit for 2023 boosted by higher interest income and lower provisions. The banks total nonmarkup expenses which include administrative and operating costs rose by 26.4 percent to Rs15.47 billion in 2023 from Rs12.24 billion in 2022 mainly due to inflation and business expansion.",
        "stock_ticker": "HMB"
    },
    {
        "title": "PSX announces recipients of the top 25 companies awards 2022",
        "date": "Tue, 10 Oct 2023 07:00:00 GMT",
        "summary": "Subject to achieving these prerequisites the companies are further weighed based on certain quantitative and qualitative criteria. These companies deserve even more credit this year as does the corporate sector overall since they have performed exceptionally well in a difficult and challenging economic environment he added.",
        "stock_ticker": "HMB"
    },
    {
        "title": "Habib Metro Bank to Set Up Exchange Company",
        "date": "Tue, 10 Oct 2023 07:00:00 GMT",
        "summary": "The bank said that its Board of Directors approved the establishment of an Exchange Company through a circular resolution dated October 9. ALSO READ Bank Alfalah to Establish Exchange Company",
        "stock_ticker": "HMB"
    },
    {
        "title": "Askari Bank announces to establish wholly-owned Exchange Company",
        "date": "Fri, 27 Oct 2023 07:00:00 GMT",
        "summary": "Askari Bank Limited has announced the establishment of an Exchange Company EC as a whollyowned subsidiary. In light of these reforms commercial banks engaged in foreign exchange business started the process of establishing whollyowned EC to cater to the needs of the public at large.",
        "stock_ticker": "HMB"
    },
    {
        "title": "Exchange companies: SBP gives NOC to Habib Metropolitan Bank",
        "date": "Mon, 30 Oct 2023 07:00:00 GMT",
        "summary": "SBP has conveyed a No Objection to Habib Metropolitan Bank Limited for establishing an exchange company in the name of Ms. Earlier this month HMB conveyed that it will establish an EC as a whollyowned subsidiary.",
        "stock_ticker": "HMB"
    },
    {
        "title": "Bank of Khyber to set up exchange company with Rs1bn initial capital",
        "date": "Sun, 05 Nov 2023 07:00:00 GMT",
        "summary": "Read This Big banks are all set to run the open market. The SBP issued noobjection certificate NOC to ABL and MCB for establishing their exchange companies.",
        "stock_ticker": "HMB"
    },
    {
        "title": "SBP Allows MCB Bank and Habib Metro to Start Currency Exchange Operations",
        "date": "Wed, 27 Mar 2024 07:00:00 GMT",
        "summary": "SBP has issued licenses for the commencement of operations to HABIBMETRO Exchange Services Limited a stock filing by HMB said earlier today. Then the regulator allowed commercial banks to set up separate exchange companies as a subsidiary.",
        "stock_ticker": "HMB"
    },
    {
        "title": "Askari Bank latest to establish wholly-owned Exchange Company",
        "date": "Fri, 27 Oct 2023 07:00:00 GMT",
        "summary": "Askari Bank Limited a subsidiary of Fauji Foundation announced on Friday it will establish an Exchange Company EC as a whollyowned subsidiary becoming the eighth banking entity to make such an announcement to date. This EC shall be a wholly owned subsidiary of AKBL it added.",
        "stock_ticker": "HMB"
    },
    {
        "title": "Askari Bank to Set Up Exchange Company",
        "date": "Fri, 27 Oct 2023 07:00:00 GMT",
        "summary": "Askari Bank Limited PSX AKBL is set to establish an Exchange Company with an authorized capital of Rs. The notice also highlighted that the Exchange Company will be a whollyowned subsidiary of AKBL.",
        "stock_ticker": "HMB"
    },
    {
        "title": "Bank of Punjab considers wholly-owned Exchange Company",
        "date": "Mon, 30 Oct 2023 07:00:00 GMT",
        "summary": "In view of the recently introduced structural reforms by State Bank of Pakistan SBP in the ECs sector and challenges posed by the recent depreciation in Pakistani rupee in the open market leading banks have been encouraged to establish wholly owned ECs with an authorized capital of Rs2.5 billion said BoP. The bank said that the establishment of an EC is subject to approval from SBP and compliance with relevant laws and regulations.",
        "stock_ticker": "HMB"
    },
    {
        "title": "PSX Announces Top 25 Companies for Year 2022",
        "date": "Wed, 11 Oct 2023 07:00:00 GMT",
        "summary": "The main bourse evaluates listed firms that have fared well in terms of profitability ratios dividendrelated factors and share turnover. Corporate Social Responsibility CSR reporting on Sustainable Development Goals SDGs ESGrelated efforts diversity and inclusivity are the other key requirements.",
        "stock_ticker": "HMB"
    }
]