[
    {
        "title": "Record profit: MCB Bank posts earnings of Rs65.3bn in 2023, up over 89% YoY",
        "date": "Tue, 06 Feb 2024 08:00:00 GMT",
        "summary": "MCB demonstrated exceptional financial performance for the outgoing year said Arif Habib Limited AHL. This is in addition to an interim dividends already paid at Rs21 per share i.e. 210.",
        "stock_ticker": "MCB"
    },
    {
        "title": "Driven by historic growth in deposits, MCB posted highest ever Profit Before Tax of Rs. 125.2bn (+75%) for the year 2023",
        "date": "Tue, 06 Feb 2024 08:00:00 GMT",
        "summary": "optimizing its earning assets mix MCB achieved significant growth in core earnings to post a historic Profit Before Tax PBT of Rs. consolidate its position as an active participant in SBPs cause for improving flow of",
        "stock_ticker": "MCB"
    },
    {
        "title": "Stocks extend losses on economic uncertainty",
        "date": "Fri, 08 Mar 2024 08:00:00 GMT",
        "summary": "Ahsan Mehanti of Arif Habib Corporation said the market sentiments remained depressed due to economic uncertainty due to the International Monetary Funds new conditions for liberalising imports higher taxation and power tariff reforms. He said the oil sector outperformed on strong financials and Govt revised refineries policy supporting upgradation.",
        "stock_ticker": "MCB"
    },
    {
        "title": "Stocks rally 612 points on steady policy rate",
        "date": "Wed, 20 Mar 2024 07:00:00 GMT",
        "summary": "Topline Securities Ltd said the KSE100 index opened on a positive note as it gained 734.22 points in early trade. Furthermore whispers of institutional buying circulated casting a favourable light on the market and contributing to its upward momentum.",
        "stock_ticker": "MCB"
    },
    {
        "title": "Stocks rise 484 points on cherry-picking",
        "date": "Thu, 29 Feb 2024 08:00:00 GMT",
        "summary": "KARACHI After posting losses overnight the stock market on Wednesday resumed its upward drive due to political clarity and strong corporate results as investors opted to do some cherrypicking at attractive levels. The market witnessed an across the board buying momentum after Moodys Investors Service maintained Pakistans ratings unchanged at Caa3 with a stable outlook but highlighted that significantly high risks of liquidity and external vulnerability challenges following highly controversial elections severely constrained decisionmaking capacity of the coalition governmentinwaiting.",
        "stock_ticker": "MCB"
    },
    {
        "title": "Stocks eke out gains amid slow trading",
        "date": "Tue, 19 Mar 2024 07:00:00 GMT",
        "summary": "Fertiliser banks and power sectors contributed positively to the index as Fauji Fertiliser Company Meezan Bank Ltd Hub Power United Bank Ltd Dawood Hercules cumulatively added 141 points to the index. On the other hand Lucky Cement Systems Ltd and MCB Bank came under heavy selling wiping out 72 points.",
        "stock_ticker": "MCB"
    },
    {
        "title": "PSX posts thin gains ahead of IMF review",
        "date": "Sun, 29 Oct 2023 07:00:00 GMT",
        "summary": "Pakistan Stock Exchange PSX recorded gains of just 0.4 in the outgoing week as investors awaited the International Monetary Fund IMF review and monetary policy announcement next week. Notably the current account deficit was recorded at 8 million for September 2023 down 95 monthonmonth.",
        "stock_ticker": "MCB"
    }
]