[
    {
        "title": "Stocks extend losses on economic uncertainty",
        "date": "Fri, 08 Mar 2024 08:00:00 GMT",
        "summary": "Ahsan Mehanti of Arif Habib Corporation said the market sentiments remained depressed due to economic uncertainty due to the International Monetary Funds new conditions for liberalising imports higher taxation and power tariff reforms. He said the oil sector outperformed on strong financials and Govt revised refineries policy supporting upgradation.",
        "stock_ticker": "MEBL"
    },
    {
        "title": "Meezan Bank Q3 profit surges 124pc",
        "date": "Fri, 20 Oct 2023 07:00:00 GMT",
        "summary": "Meezan Bank announced the highestever quarterly earnings which came slightly higher than industry expectations said an analyst at Topline Securities a brokerage firm in Karachi. Nestle Pakistan quarterly profit jumps 30pc Nestle Pakistan Ltd reported a 30 percent rise in its thirdquarter net profit on Thursday boosted by higher revenue across its products and costcutting measures.",
        "stock_ticker": "MEBL"
    },
    {
        "title": "Meezan Bank Posts Record-Breaking Annual Profit in 2023",
        "date": "Thu, 15 Feb 2024 08:00:00 GMT",
        "summary": "84.5 billion for the calendar year that ended on December 31 2023 up 88 percent yearonyear YoY from Rs. According to Topline Securities this was driven by rising asset yields and the growth of zerocost current account deposits.",
        "stock_ticker": "MEBL"
    },
    {
        "title": "Another Record: Stock Exchange Surges To Unprecedented Heights, Breezes Past 56,000 Points",
        "date": "Mon, 13 Nov 2023 08:00:00 GMT",
        "summary": "The Pakistan Stock Exchange continued its positive momentum from the last week as it gained another 1132.22 points on Monday to surge past another major psychological barrier of 56000 points. The index opened on Monday morning at 55391.36 points.",
        "stock_ticker": "MEBL"
    },
    {
        "title": "Pakistani Banks that posted highest profits in 2023",
        "date": "Thu, 28 Mar 2024 07:00:00 GMT",
        "summary": "In the year 2023 Pakistans banking sector saw unprecedented growth with performance leading to returns that outpaced Stock Market. United Bank Limited UBL also moves up raking its highestever annual profit of Rs56.47 billion in 2023 marking a 74 percent surge as compared to previous year.",
        "stock_ticker": "MEBL"
    },
    {
        "title": "Islamic banks brace for minimum deposit rate",
        "date": "Tue, 28 Nov 2023 08:00:00 GMT",
        "summary": "KARACHI Share prices of Islamic banks took a beating on Monday thanks to Finance Minister Dr Shamshad Akhtars recent statement that customers are getting shortchanged by Shariacompliant lenders by way of insufficient returns on deposits. A research report written by JS Global Head of Research Amreen Soorani stated that Islamic banks are currently offering savings rates that are between seven and 9.5 percentage points lower than the MDR offered by conventional banks.",
        "stock_ticker": "MEBL"
    },
    {
        "title": "Bulls tighten grip on PSX with 875-point rally",
        "date": "Fri, 01 Mar 2024 08:00:00 GMT",
        "summary": "The traded value however increased by 6.57pc to Rs17.05bn on a dayonday basis. Foreign investors remained net buyers as they purchased shares worth 4.14m.",
        "stock_ticker": "MEBL"
    }
]