[
    {
        "title": "NBP’s profit surges by 72%, clocks in at Rs53.3bn in 2023",
        "date": "Thu, 22 Feb 2024 08:00:00 GMT",
        "summary": "As a result the banks net markupreturn earned increased to Rs169.36 billion in 2023 as compared to Rs117.1 billion in 2022 a jump of 45. During the period NBPs share of profit from joint venture and from association increased to Rs1.47 billion as compared to only Rs450 million in 2022 an increase of 227.",
        "stock_ticker": "NBP"
    },
    {
        "title": "NBP posts 72 percent jump in annual profit, holds off dividend",
        "date": "Fri, 23 Feb 2024 08:00:00 GMT",
        "summary": "Earnings per share rose to Rs24.96 from Rs14.49 the bank said adding that its board did not recommend any cash dividend. The countrys economy continues to grapple with high fiscal deficit sky rocketing inflation and power tariff hikes.",
        "stock_ticker": "NBP"
    },
    {
        "title": "Stocks at PSX soar for second straight day",
        "date": "Wed, 27 Mar 2024 07:00:00 GMT",
        "summary": "On Monday the KSE100 gained 373.82 points a momentum led by buying in indexheavy oil and gas stocks. Moreover the countrys 10 power Distribution Companies Discos have approached the National Electric Power Regulatory Authority NEPRA to further burden consumers with Rs 2.765 trillion for adjustment indexation of different tariff components of tariff for the year 202425 multiYear Tariff MYT components.",
        "stock_ticker": "NBP"
    },
    {
        "title": "Pakistan Stock Exchange Benchmark Index Closes Almost Flat – OpEd",
        "date": "Sat, 23 Mar 2024 07:00:00 GMT",
        "summary": "Additionally IMF has recommended eliminating GST exemptions on petroleum products and other taxes whereby despite a easing weekly inflation an increase in gas price as sought by Sui twins and implementation of 18GST on POL products pose risks to the inflation outlook. Investors are advised to remain cautious and maintain positions in strong valuation main board stocks particularly those offering attractive dividend yields.",
        "stock_ticker": "NBP"
    }
]