[
    {
        "title": "Standard Chartered profit jumps 115% in CY23",
        "date": "Fri, 23 Feb 2024 08:00:00 GMT",
        "summary": "This is in addition to the interim dividend already paid at Rs6.5 per share i.e. 65. The profit is attributed to a significant increase in net interest income and provisioning reversals.",
        "stock_ticker": "SCBPL"
    },
    {
        "title": "First Mover Americas: Standard Chartered Bank Thinks BTC Will Reach $100K by End of 2024",
        "date": "Wed, 29 Nov 2023 08:00:00 GMT",
        "summary": "For crypto things are going as expected according to Standard Chartered Bank which reiterated its April forecast that bitcoin BTC would reach 100000 by the end of 2024. The team also noted that the next Bitcoin halving  a mechanism to limit supply and expected to take place in late April 2024  will be another source of price upside.",
        "stock_ticker": "SCBPL"
    },
    {
        "title": "Standard Chartered Bank aims to boost Saudi-China economic ties with strategic expansion - Arab News",
        "date": "Sun, 17 Mar 2024 07:00:00 GMT",
        "summary": "Standard Chartered Bank aims to boost SaudiChina economic ties with strategic expansion  Arab News",
        "stock_ticker": "SCBPL"
    },
    {
        "title": "Standard Chartered profit jumps 115% in CY23",
        "date": "Fri, 23 Feb 2024 08:00:00 GMT",
        "summary": "This is in addition to the interim dividend already paid at Rs6.5 per share i.e. 65. The profit is attributed to a significant increase in net interest income and provisioning reversals.",
        "stock_ticker": "SCBPL"
    },
    {
        "title": "Standard Chartered Bank aims to boost Saudi-China economic ties with strategic expansion - Arab News",
        "date": "Sun, 17 Mar 2024 07:00:00 GMT",
        "summary": "Standard Chartered Bank aims to boost SaudiChina economic ties with strategic expansion  Arab News",
        "stock_ticker": "SCBPL"
    },
    {
        "title": "First Mover Americas: Standard Chartered Bank Thinks BTC Will Reach $100K by End of 2024",
        "date": "Wed, 29 Nov 2023 08:00:00 GMT",
        "summary": "For crypto things are going as expected according to Standard Chartered Bank which reiterated its April forecast that bitcoin BTC would reach 100000 by the end of 2024. The team also noted that the next Bitcoin halving  a mechanism to limit supply and expected to take place in late April 2024  will be another source of price upside.",
        "stock_ticker": "SCBPL"
    },
    {
        "title": "Standard Chartered Commodities Head Flags Improving Oil Market Fundamentals",
        "date": "Tue, 20 Feb 2024 08:00:00 GMT",
        "summary": "There has been an inventory draw in only three years with the average January change a build of 1.2 million barrels per day he added. In a previous post on X Centcom said four antiship ballistic missiles launched from Iranianbacked Houthicontrolled areas of Yemen into the Red Sea.",
        "stock_ticker": "SCBPL"
    },
    {
        "title": "Standard Chartered Bank explains why funds are flowing from the US to Japan",
        "date": "Tue, 27 Feb 2024 08:00:00 GMT",
        "summary": "Japanese stock markets are attracting investments from abroad especially the US driven by robust corporate earnings and appealing valuations says Fook Hien Yap a Senior Investment Strategist at Standard Chartered Bank.Yap observes that Japans market appeals to investors as it is still underowned and he anticipates the momentum in Japanese equities to persist for a while given that foreign investments in the region tend to remain for extended periods.We see signs that with corporate governance improvements encouragement from the Tokyo Stock Exchange that is pushing companies to do more shareholderfriendly policies in terms of returning cash to shareholders. Data from Japanese exchanges show that during the week foreign buyers netted 817.43 billion yen 5.44 billion in local equities their largest weekly net acquisition since January 12.Foreign investors returned to Japanese stocks in 2023 after remaining net sellers in six out of eight years up to 2022 driven by corporate governance improvements and the yens depreciation against the dollar.",
        "stock_ticker": "SCBPL"
    }
]