[
    {
        "title": "UBL leads in home remittance market in Pakistan",
        "date": "Tue, 19 Dec 2023 08:00:00 GMT",
        "summary": "1 choice for Overseas Pakistanis and holding the highest market share in home remittances. United Bank Limited UBL has once again proven its leadership in the banking industry by winning Highest Remittance Mobilizing Bank of Pakistan at the Pakistan Remittance Summit 2023 held in Malaysia.",
        "stock_ticker": "UBL"
    },
    {
        "title": "Stocks turn in gloomy performance",
        "date": "Tue, 09 Jan 2024 08:00:00 GMT",
        "summary": "Initially the index made an intraday high of 555 points to 65069 level. Due to increasing political noise on the holding of upcoming general elections on Feb 8 investors opted to trim their equity positions by booking profit in selective stocks of banks exploration and production tech and OMC sectors.",
        "stock_ticker": "UBL"
    },
    {
        "title": "UBL wins PSX’s ‘Top Companies of the Year’ award",
        "date": "Thu, 14 Dec 2023 08:00:00 GMT",
        "summary": "KARACHIUnited Bank Limited UBL was presented with the Pakistan Stock Exchanges PSX Top Companies of the Year award for 2022 in Karachi recently. On receiving the award Muhammad Jawaid Iqbal President  CEO UBL said UBL is honoured to be recognized as one of Pakistans top companies for 2022.",
        "stock_ticker": "UBL"
    },
    {
        "title": "UBL profits soar 76 percent in 2023, pays out 440 percent dividend",
        "date": "Thu, 22 Feb 2024 08:00:00 GMT",
        "summary": "KARACHI United Bank Limited Pakistans secondlargest private bank posted a record annual profit of Rs56.47 billion for 2023 up 76.1 percent from a year earlier as it benefited from high interest rates and lower provisions. The bank attributed its strong performance to proactive actions to manage businesses a clientfocused strategy emphasis on technology effective cost controls rationalization of human resource and excellent performance of its Islamic banking subsidiary Ikhlas Islamic Banking.",
        "stock_ticker": "UBL"
    },
    {
        "title": "Regent Plaza’s sale seems to be a classic case of insider trading. But will the regulators investigate?",
        "date": "Sun, 22 Oct 2023 07:00:00 GMT",
        "summary": "The document was 18 pages of bullet points that can very easily be boiled down to one sentence When in doubt give more information than you think necessary. The SECP is empowered to investigate insider trading and were once actually quite active in issuing press releases when they busted someone.",
        "stock_ticker": "UBL"
    },
    {
        "title": "UBL’s profit clocks in at Rs56.5bn, up 76% in 2023",
        "date": "Wed, 21 Feb 2024 08:00:00 GMT",
        "summary": "This is in addition to the interim dividend already paid at Rs33 per share i.e. 330. The fee and commission income earned by UBL in 2023 amounted to Rs19.75 billion an increase of nearly 15 against Rs17.24 billion earned in the same period last year.",
        "stock_ticker": "UBL"
    },
    {
        "title": "Stocks lose 1,133 points on instability fears",
        "date": "Fri, 16 Feb 2024 08:00:00 GMT",
        "summary": "However it started to come off sharply after news reports on different media channels regarding PTI engaging in talks with different parties to form governments in the centre and Punjab. Ahsan Mehanti of Arif Habib Corporation said default risks amid political instability policy uncertainty and massive gas price hike delivered by the ECC to meet an IMF deadline to recover an additional Rs242bn from gas consumers mainly industries played a catalyst role in bearish close.",
        "stock_ticker": "UBL"
    },
    {
        "title": "Stocks drop for third day as politics overshadow rate-cut hopes",
        "date": "Thu, 18 Jan 2024 08:00:00 GMT",
        "summary": "Stocks closed lower on geopolitical uncertainty and political noise said Ahsan Mehanti an analyst at Arif Habib Corp. On the flip side ENGRO EFERT MEBL and UBL collectively added 253 points as they witnessed rejuvenated buying interest.",
        "stock_ticker": "UBL"
    },
    {
        "title": "UBL’s profit up 128% during July-September",
        "date": "Wed, 25 Oct 2023 07:00:00 GMT",
        "summary": "This is in addition to the interim dividend already paid at Rs22 per share i.e. 220. This outstanding performance was primarily fueled by higher net interest income and provisioning reversals said Arif Habib Limited AHL in a note.",
        "stock_ticker": "UBL"
    },
    {
        "title": "Stocks gain on oil and banking rally; KSE-100 nears 66,000 level",
        "date": "Wed, 27 Mar 2024 07:00:00 GMT",
        "summary": "Stocks closed higher led by oil and banking scrips on strong valuations said analyst Ahsan Mehanti at Arif Habib Corp. Surging global stocks rupee stability amid foreign inflows and higher global crude oil prices played a catalytic role in the bullish close at the PSX. Other significant turnover stocks included National Bank XD Oil  Gas Dev. WorldCall Telecom Pak Reinsurance Hascol Petrol Agritech Limited The Organic Meat and Cnergyico PK.",
        "stock_ticker": "UBL"
    }
]