[
    {
        "title": "BankIslami records 137% jump in profit during 2023",
        "summary": "This is in addition to the interim cash dividend already paid at Rs1.75 per share i.e. 17.5%. BIPL generated Rs1.8 billion in fee and commission income, up over 24% as compared to the same period last year. The tax expense of BankIslami increased over 150% year-on-year to Rs9.48 billion in 2023."
    },
    {
        "title": "Islamic banks brace for minimum deposit rate",
        "summary": "KARACHI: Share prices of Islamic banks took a beating on Monday, thanks to Finance Minister Dr Shamshad Akhtar’s recent statement that customers are getting short-changed by Sharia-compliant lenders by way of insufficient returns on deposits. Speaking to a TV host, Dr Akhtar said the State Bank of Pakistan (SBP) should review the issue of minimum deposit rate (MDR) — a provision that Islamic banks are currently exempted from. A research report written by JS Global Head of Research Amreen Soorani stated that Islamic banks are currently offering savings rates that are between seven and 9.5 percentage points lower than the MDR offered by conventional banks."
    },
    {
        "title": "BankIslami full-year profit soars 137pc",
        "summary": "— Facebook/BankIslami Pakistan Limited  KARACHI: BankIslami Pakistan Limited, one of the country’s leading Islamic banks, on Wednesday reported a 137 percent surge in its profit after tax for the year 2023, boosted by a strong growth in its core banking income. \"We are grateful for the blessings of the Almighty as we have surpassed PKR 1 trillion in deposits and achieved a 71 percent increase in profitability this year,\" said Khurram Shahzad Khan, president and chief executive officer of HABIBMETRO. Cnergyico PK narrows loss in H1  Cnergyico PK Limited reported a smaller loss for the first half of the fiscal year 2024, as lower costs and improved margins offset a slight decline in revenue."
    },
    {
        "title": "Here’s What Happened in Pakistan’s Banking Sector in 2023",
        "summary": "ALSO READ Bank Alfalah Launches Pakistan’s First Digital Payments Sales and Service Centers Focusing on Merchants and Small Businesses  Some of the initiatives taken by different commercial banks will be followed by other competing banks in the near future. JS Bank maintained a different strategic position, which will increase its profitability and influence in the banking industry after this deal. The deal can be a win-win situation for both entities in scaling up their business and profitability."
    },
    {
        "title": "Islami Bank's Tk256cr shares traded at DSE on Wednesday",
        "summary": "Islami Bank share transactions contributed around 40% to the total DSE turnover. According to the DSE website, a total of 7.87 crore shares were traded at Tk32.6 each. On Wednesday, the benchmark index of the DSE managed to stay afloat in green territory for two consecutive sessions owing to investors' continued chase for particular issues that they perceived as lucrative, along with marginal price appreciation in selective large-cap scrips."
    },
    {
        "title": "Govt to test-run sukuk auction ahead of bond launch",
        "summary": "KARACHI: Pakistan Stock Exchange (PSX) will hold a mock transaction of the upcoming one-year listed domestic Islamic bond, known as sukuk, on Friday (December 1). The State Bank of Pakistan issuance price and par value will be used to calculate withholding tax. They sees deposit rate can potentially be linked to a benchmark Islamic instruments (for e.g., sukuk) return."
    },
    {
        "title": "The past year for Bank Islam Malaysia Berhad (KLSE:BIMB) investors has not been profitable",
        "summary": "Passive investing in an index fund is a good way to ensure your own returns roughly match the overall market. KLSE:BIMB Earnings and Revenue Growth December 18th 2023  We know that Bank Islam Malaysia Berhad has improved its bottom line lately, but what does the future have in store? I find it very interesting to look at share price over the long term as a proxy for business performance."
    },
    {
        "title": "Bank Islam Malaysia Berhad Announces Single-Tier Interim Dividend for the Financial Year Ending 31 December 2023, Payable on 12 January 2024",
        "summary": "The Bank is principally engaged in Islamic banking business and the provision of related financial services. The Bank has approximately 135 branches and over 900 self-service terminals nationwide. The Treasury segment is engaged in undertaking funding activities through borrowings and investing in liquid assets such as short-term placements and corporate and government debt securities."
    },
    {
        "title": "Interested In Bank Islam Malaysia Berhad's (KLSE:BIMB) Upcoming RM00.0422 Dividend? You Have Three Days Left",
        "summary": "Bank Islam Malaysia Berhad paid out 68% of its earnings to investors last year, a normal payout level for most businesses. That explains why we're not overly excited about Bank Islam Malaysia Berhad's flat earnings over the past five years. In the last two years, Bank Islam Malaysia Berhad has lifted its dividend by approximately 24% a year on average."
    },
    {
        "title": "Bank Islam Malaysia Berhad (KLSE:BIMB) is a favorite amongst institutional investors who own 73%",
        "summary": "Let's take a closer look to see what the different types of shareholders can tell us about Bank Islam Malaysia Berhad. However, it is best to be wary of relying on the supposed validation that comes with institutional investors. Take risks for example - Bank Islam Malaysia Berhad has 2 warning signs we think you should be aware of."
    },
    {
        "title": "MSCI adds 22 Pakistan firms to frontier market index",
        "summary": "— Online  KARACHI: The stock market is likely to receive a boost as MSCI Inc. on Tuesday announced the inclusion of 22 Pakistani companies in its Frontier Market and Small Cap indexes, effective from Feb. 29. \"Due to this adjustment, we anticipate some net flows, although the quantum will not be significant.\" In September 2021, Pakistan was downgraded from its status as an emerging market, a little over four years after it was reclassified from the Frontier Markets (FM) Index by MSCI."
    },
    {
        "title": "Now IDB pulls out of Islami Bank directorship",
        "summary": "Islami Bank's other foreign partner, Kuwait Finance House, also sold out its holdings. Arabsas Travel and Tourist Agency, another Saudi-based company, sold its entire holding of 9.99% shares in Islami Bank through the Chittagong Stock Exchange last month. It said in its half yearly financial statement that the net operating cash flow per share (NOCFPS) had significantly decreased mainly due to less deposit mobilisation from customers by Tk2,541 crore and a decrease of placement from other banks by Tk7,380 crore."
    },
    {
        "title": "Just Three Days Till Bank Islam Malaysia Berhad (KLSE:BIMB) Will Be Trading Ex-Dividend",
        "summary": "As a result, readers should always check whether Bank Islam Malaysia Berhad has been able to grow its dividends, or if the dividend might be cut. Bank Islam Malaysia Berhad paid out more than half (68%) of its earnings last year, which is a regular payout ratio for most companies. It's not encouraging to see that Bank Islam Malaysia Berhad's earnings are effectively flat over the past five years."
    },
    {
        "title": "How merger issues deal a blow to bank stocks",
        "summary": "Infographics: TBS  With the signing of a memorandum of understanding (MoU) for the merger with Padma Bank, a fourth-generation lender struggling for survival, Exim Bank shares plummeted below their face value. Shahidul Islam, chief executive officer of VIPB Asset Management, told The Business Standard, \"Whether it will be good or bad for investors depends on how many shares are allocated to shareholders of the weaker bank.\" Banks will be categorised for mergers  The Bangladesh Bank, as part of regular monitoring, will categorise the banks into three broad groups, sound, stable, and distressed, based on a set of selection criteria scores."
    },
    {
        "title": "Bank stocks shield market against decline",
        "summary": "At the Dhaka bourse, 227 scrips declined, 126 advanced, and 40 remained unchanged. Market insiders said investors displayed heightened activity in purchasing bank shares, which had long been restricted by the floor price, during the session. Institutional investors, including stock dealers, kept buying shares they preferred at a lower price, and the optimism for a recovery helped avert forced selling in leveraged accounts, said EBL Securities Managing Director Sayadur Rahman, who is also the president of CEO Forum, representing the top 30 brokerage firms owned by banks or other financial institutes."
    },
    {
        "title": "Stocks rally on first day after national polls",
        "summary": "Besides, all-share price index CASPI of the port city bourse Chittagong Stock Exchange (CSE) jumped 59 points to 18,568. Also, many investors fell into trouble with their margin loans as they could not sell the shares. \"If the floor price restriction is lifted, there will be a lot of sales pressure, and funds are needed to absorb it."
    },
    {
        "title": "Strong Bank stocks propel DSEX to hit 16-month high",
        "summary": "Infographic: TBS  The benchmark index DSEX at the Dhaka Stock Exchange hit 16-month high on Sunday, surpassing 6,400 points propelled by strong performance of bank stocks amid a selling spree in other sectors. It means that potential investors, who tend to invest in fundamental stocks for a long term, are back in the market, they added. Meanwhile, the port city bourse, Chittagong Stock Exchange, also settled on green terrain."
    },
    {
        "title": "Capital market takes hit from economic uncertainties: Cenbank",
        "summary": "\"If the share price is stuck at one place, then no investor will come to this market.\" Under the revised guidelines, bonds, debentures, and Islamic Shariah-compliant securities are exempted from banks' market exposure limits. Moreover, the market regulator outlined specific roles and responsibilities for independent directors of listed securities or companies on 18 October 2023."
    },
    {
        "title": "Only 12 companies’ shares still have floor price",
        "summary": "That means their prices may increase or decrease by up to 10 per cent a day. It’s nothing to be feared, and the market will recover very soon, they said. The share prices of most companies have been stuck at their floor prices for an extended period, pushing investors towards liquidating their holdings and thus creating a liquidity crisis in the market."
    },
    {
        "title": "NRB Bank, Protective Islami Life Insurance get waivers for IPO",
        "summary": "This practice is in apparent contravention of the Public Issue Rules, which stipulate that a company cannot apply for an IPO if it increases its paid-up capital by issuing new shares within two preceding years. While the BSEC has already approved NRB Bank's IPO, Protective Islami Life's application is still pending. Also, it will issue 22.5 lakh ordinary shares to its employees, which the BSEC has already approved."
    }
]