[
    {
        "title": "PSX seeks clarification from 19 companies on unusual share price movement",
        "summary": "The Pakistan Stock Exchange (PSX) has sought clarification from 19 companies to explain the unusual movements in their share prices and volumes. The stock exchange stated that this development underscores the vigilance and regulatory oversight exercised by the PSX aimed at ensuring that all market participants operate within a framework defined by transparency and integrity. Following the PSX letter, Sapphire Fibres Limited, Samba Bank, Pakistan National Shipping Corporation, GEMUNSL, First Punjab Modaraba and Agritech Limited said on December 21 that they did not know of any cause/ significant information that could have led to the abnormal change in market price or volume during the specified time period."
    },
    {
        "title": "Here’s What Happened in Pakistan’s Banking Sector in 2023",
        "summary": "ALSO READ Bank Alfalah Launches Pakistan’s First Digital Payments Sales and Service Centers Focusing on Merchants and Small Businesses  Some of the initiatives taken by different commercial banks will be followed by other competing banks in the near future. JS Bank maintained a different strategic position, which will increase its profitability and influence in the banking industry after this deal. The deal can be a win-win situation for both entities in scaling up their business and profitability."
    },
    {
        "title": "Ten years ago Chenab Limited defaulted on its loans. Now it looks towards second act",
        "summary": "In small towns like Toba Tek Singh, land-owning farmers realised cotton was an important crop for the ruling British Empire. But Latif had a belief that his family’s future lay in manufacturing textiles rather than just farming and selling cotton. At one point in time, the company was making $30 million worth of exports on a monthly basis and employed 12,000 people."
    },
    {
        "title": "Honda CG 125 2024 Easy Installment Plans from All Banks – Sept 2023",
        "summary": "The Honda CG 125 is highly regarded in Pakistan for its elegance and impressive performance. Inflation has made it challenging for many to purchase a Honda CG 125 in cash. This article explores Honda CG 125 installment plans to help you make your dream of owning one a reality."
    },
    {
        "title": "Karnataka Bank shares tank 9% post Q2 results; NII rises to Rs 822 crore",
        "summary": "Market cap of the firm fell to Rs 6809 crore. Karnataka Bank Ltd reported a 19.7% fall in net profit at Rs 330.3 crore for the quarter ended September 2023 against profit of Rs 412 crore in the September 2022 quarter. Also read: Diwali 2023 picks: Axis Bank, DLF, Power Grid among stocks picked by Chola Securities"
    },
    {
        "title": "The IMEC versus the BRI: What’s the future? - The Financial Express",
        "summary": "The IMEC versus the BRI: What’s the future? The Financial Express"
    }
]